#include <iostream>
#include <Windows.h>
using namespace std;

// 12 Напишіть програму для визначення терміну служби електричної лампочки на основі її потужності за допомогою наступної таблиці рішень.

void main() {
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);

    int power;
    cout << "Введіть потужність лампочки, Вт: "; // введення потужності лампочки
    cin >> power;

    if (power == 25) { // визначення терміну служби лампочки за допомогою if
        cout << "Термін служби лампочки: 2500 годин" << endl;
    }
    else if (power == 40 || power == 60) {
        cout << "Термін служби лампочки: 1000 годин" << endl;
    }
    else if (power == 75 || power == 100) {
        cout << "Термін служби лампочки: 750 годин" << endl;
    }
    else if (power == 150 || power == 200) {
        cout << "Термін служби лампочки: 500 годин" << endl;
    }
    else {
        cout << "Невідома потужність лампочки. Будь ласка, перевірте введені дані." << endl;
    }
}
