#include <iostream>
#include <Windows.h>
using namespace std;

// 11 Напишіть програму для виведення характеристики землетрусу за шкалою Ріхтера, використовуючи наступну таблицю рішень.

void main() {
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);

    double scale;
    cout << "Введіть магнітуду землетрусу за шкалою Ріхтера: "; // введення магнітуди землетрусу за шкалою Ріхтера
    cin >> scale;

    if (scale < 5) { // визначення характеристики землетрусу за шкалою Ріхтера
        cout << "Легке, немає руйнувань" << endl;
    }
    else if (scale < 5.5) {
        cout << "Середнє, невеликі руйнування" << endl;
    }
    else if (scale < 6.5) {
        cout << "Серйозне, руйнування та пошкодження стін" << endl;
    }
    else if (scale < 7.5) {
        cout << "Лихо, багато будинків та будівель пошкоджено" << endl;
    }
    else {
        cout << "Катастрофа, більшість будинків та будівель зруйновано" << endl;
    }
}
