#include <iostream>
#include <Windows.h>
using namespace std;

/* 5 Напишіть програму обчислення суми та добутку чисел, що вводяться з клавіатури :
a)	кількість чисел попередньо вводиться із клавіатури;
b)	обчислення припиняються на запит програми. */

int main() 
{
    int sum = 0;
    int product = 1;
    char choice;

    // вивід меню та вибір режиму введення
    cout << "Виберіть режим введення:\n";
    cout << "a) Кількість чисел попередньо вводиться;\n";
    cout << "b) Обчислення припиняються на запит.\n";

    cout << "Ваш вибір: ";
    cin >> choice;

    if (choice == 'a' || choice == 'A') {
        int count;
        // введення кількості чисел
        cout << "Введіть кількість чисел: ";
        cin >> count;

        if (count <= 0) {
            // перевірка правильності введення кількості чисел
            cout << "Неправильна кількість чисел. Програма завершиться.\n";
            return 1;
        }

        for (int i = 0; i < count; ++i) {
            int number;
            // введення чисел та їх обчислення
            cout << "Введіть число " << i + 1 << ": ";
            cin >> number;

            sum += number;
            product *= number;
        }
    }
    else if (choice == 'b' || choice == 'B') {
        do {
            int number;
            // введення чисел та їх обчислення (з припиненням на запит)
            cout << "Введіть число: ";
            cin >> number;

            sum += number;
            product *= number;

            cout << "Продовжити введення? (y/n): ";
            cin >> choice;

        } while (choice == 'y' || choice == 'Y');
    }
    else {
        // перевірка правильності введення режиму
        cout << "Невірний вибір. Програма завершиться.\n";
        return 1;
    }

    // виведення результатів
    cout << "Сума введених чисел: " << sum << endl;
    cout << "Добуток введених чисел: " << product << endl;

    return 0;
}